Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-10-18.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་བསླབ་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྟེན་དུ་འགྱུར་བ་བདག་ལ་བཤད་དུ་གསོལ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how having trained in it they become supports for all beings!”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཁྱིམ་བདག་མཁས་པས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་ཀྱིས་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལེགས་སོ་ལེགས་སོ།
en: The householder Vidvān said to Sudhana, the head merchant’s son, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment!

source: །རིགས་ཀྱི་བུ་སེམས་ཅན་གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་ཚོལ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་བལྟ་བས་མྱི་ངོམས་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བས་མྱི་སྐྱོ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་ལ་རིམ་གྲོ་བྱ་བས་སྒྱིད་ལུག་པ་མེད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་བཙལ་བས་ཡིད་མྱི་བདེ་བ་མྱི་སྐྱེད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་བཙལ་བ་ལས་ཕྱིར་མྱི་ལྡོག་པ་དང་། དགེ་བའི་བཤེས་གཉེན་ལ་མོས་ཤིང་དང་བའི་ཡིད་ལས་རྣམ་པར་མྱི་ལྡོག་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་ངོར་བལྟ་བ་ལས་ཕྱིར་མྱི་ལྡོག་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་གི་ཚུལ་ལ་ཞུམ་པ་མྱེད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་ལ་རིམ་གྲོ་དང་བསྙེན་བཀུར་བྱ་བས་མྱི་སྐྱོ་བ་དེ་ལྟ་བུ་ནི་ཤིན་ཏུ་དཀོན་ནོ།
en: “Noble one, it is rare to find a being who develops the aspiration for the highest, complete enlightenment, who seeks the bodhisattva conduct, who never has enough of gazing upon a kalyāṇamitra, who never tires of coming into the presence of a kalyāṇamitra, who never becomes dispirited in serving a kalyāṇamitra, who never becomes unhappy with seeking a kalyāṇamitra, who never turns back from seeking a kalyāṇamitra, who never ceases to sincerely yearn for and be attracted to a kalyāṇamitra, who never turns away from gazing upon a kalyāṇamitra, who is never despondent in following the instructions of a kalyāṇamitra, and who never wearies of serving and honoring a kalyāṇamitra.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཁོ་བོའི་འཁོར་འདི་དག་མཐོང་ངམ།
en: “Noble one, do you see those in my entourage?”

source: སྨྲས་པ་འཕགས་པ་མཐོང་ངོ་།
en: Sudhana replied, “Yes, Ārya, I see them.”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་འདི་དག་ཀུན་ཀྱང་ཁོ་བོས་བླ་ན་མྱེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དག་སྟེ།
en: Vidvān said, “Noble one, I made all of them develop the aspiration for the highest, complete enlightenment.

source: འདི་དག་ནི་ཁོ་བོས་དེ་བཞིན་གཤེགས་པའི་རིགས་སུ་བསྐྱེད་པའོ། །འདི་དག་ནི་ཁོ་བོས་ཕ་རོལ་ཏུ་ཕྱིན་པས་བསྡུས་ཏེ་གསོལ་པའོ།
en: I have caused them to be reborn in the family of the tathāgatas. I have nourished them through the accumulation of the perfections.

source: །འདི་དག་ནི་ཁོ་བོས་ཆོས་དཀར་པོ་ཐམས་ཅད་ཀྱིས་བསྐྱེད་པའོ།
en: I have made them practice all the good qualities.

source: །འདི་དག་ནི་ཁོ་བོས་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལ་རྣམ་པར་བསྐྱེད་པའོ།
en: I have made them develop the ten strengths of the tathāgatas.

source: །འདི་དག་ནི་ཁོ་བོས་འཇིག་རྟེན་གྱི་རིགས་ལས་གྱེན་དུ་བསྐྱོད་པའོ།
en: I have made them transcend the family of the world.

source: །འདི་དག་ནི་ཁོ་བོས་དེ་བཞིན་གཤེགས་པའི་རིགས་ལ་བཀོད་པའོ།
en: I have established them in the family of the tathāgatas.

source: །འདི་དག་ནི་ཁོ་བོས་འཇིག་རྟེན་གྱི་ལམ་གྱི་འཁོར་ལོ་ལས་བཟློག་པའོ།
en: I have made them turn away from the wheel of worldly existences.

source: འདི་དག་ནི་ཁོ་བོས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ལ་བཙུད་པའོ།
en: I have made them enter into the turning of the wheel of the Dharma.

source: །འདི་དག་ནི་ཁོ་བོས་ངན་སོང་གསུམ་གྱི་རྒྱུད་དུ་ལྟུང་བ་ལས་ཡོངས་སུ་བཟུང་བའོ།
en: I have saved them from falling into lives in the three lower existences.

source: །འདི་དག་ནི་ཁོ་བོས་ཆོས་ཉིད་ཁོང་ད་ཆུད་པར་བྱ་བ་ལ་བཀོད་པ་སྟེ།
en: I have established them in the understanding of the true nature of phenomena.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐྱབས་སུ་གྱུར་པ་ཡིན་ནོ།
en: “Noble one, it is in that way that bodhisattvas become a refuge for all beings.

source: །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་ཡིད་ཀྱི་མཛོད་ནས་བྱུང་བའི་བསོད་ནམས་མང་པོ་ཐོབ་པ་སྟེ།
en: “Noble one, I have attained the bodhisattva liberation calledthe merit that arises from the treasury of mind.

source: དེའི་མཐུས་ཁོ་བོ་ནི་ཟས་འདོད་པ་རྣམས་ལ་ཁ་ཟས་ཀྱི་སྦྱིན་པ་བྱེད་དོ།
en: Through its power I give food to those who wish for food; drink for those who wish for drink; excellent flavors to those who wish for excellent flavors; hard food to those who wish for hard food; soft food to those who wish for soft food; food that is licked to those who wish for food that is licked; food that is sucked to those who wish for food that is sucked; clothes to those who wish for clothes; flowers to those who wish for flowers; garlands to those who wish for garlands; perfume to those who wish for perfume; incense to those who wish for incense; ointments to those who wish for ointments; powders to those who wish for powders;

source: །བཏང་བ་འདོད་པ་རྣམས་ལ་བཏུང་བ་དང་། རོའི་དམ་པ་འདོད་པ་རྣམས་ལ་རོའི་དམ་པ་དང་། བཟའ་བ་འདོད་པ་རྣམས་ལ་བཟའ་བ་དང་། བཅའ་བ་འདོད་པ་རྣམས་ལ་བཅའ་བ་དང་། བལྡག་པ་འདོད་པ་རྣམས་ལ་བལྡག་པ་དང་། མུར་པ་འདོད་པ་རྣམས་ལ་མུར་པ་དང་། གོས་འདོད་པ་རྣམས་ལ་གོས་དང་། མེ་ཏོག་འདོད་པ་རྣམས་ལ་མེ་ཏོག་དང་། ཕྲེང་བ་འདོད་པ་རྣམས་ལ་ཕྲེང་བ་དང་། སྤོས་འདོད་པ་རྣམས་ལ་སྤོས་དང་། བདུག་པ་འདོད་པ་རྣམས་ལ་བདུག་པ་དང་། བྱུག་པ་འདོད་པ་རྣམས་ལ་བྱུག་པ་དང་། ཕྱེ་མ་འདོད་པ་རྣམས་ལ་ཕྱེ་མ་དང་། རྒྱན་དང་ལྷབ་ལྷུབ་འདོད་པ་རྣམས་ལ་རྒྱན་དང་ལྷབ་ལྷུབ་དང་། རིན་པོ་ཆེ་འདོད་པ་རྣམས་ལ་རིན་པོ་ཆེ་དང་། གསེར་འདོད་པ་རྣམས་ལ་གསེར་དང་། དངུལ་འདོད་པ་རྣམས་ལ་དངུལ་དང་། མུ་ཏིག་འདོད་པ་རྣམས་ལ་མུ་ཏིག་དང་། རྟེན་འདོད་པ་རྣམས་ལ་རྟེན་དང་། སྟན་འདོད་པ་རྣམས་ལ་བསྟན་དང་། མལ་ཆ་འདོད་པ་རྣམས་ལ་མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་འདོད་པ་རྣམས་ལ་ན་བའི་གསོས་སྨན་དང་ཡོ་བྱད་དང་། བཞོན་པ་འདོད་པ་རྣམས་ལ་བཞོན་པ་དང་། དགའ་བ་འདོད་པ་རྣམས་ལ་དགའ་བ་དང་། གླང་པོ་དང་རྟ་དང་། ཤིང་རྟ་དང་། བ་ལང་དང་། བོང་བུ་དང་མ་ཧེ་དང་། ར་ལུག་འདོད་པ་རྣམས་ལ་གླང་པོ་དང་། རྟ་དང་ཤིང་རྟ་དང་བ་ལང་དང་། བོང་བུ་དང་མ་ཧེ་དང་། ར་ལུག་དང་། རྒྱལ་མཚན་དང་། གདུགས་དང་། བ་དན་འདོད་པ་རྣམས་ལ་རྒྱལ་མཚན་དང་། གདུགས་དང་བ་དན་དང་། བྲན་ཕོ་དང་བྲན་མོ་འདོད་པ་རྣམས་ལ་བྲན་ཕོ་དང་བྲན་མོ་དང་འཁོར་གྱི་བྱིས་པ་འདོད་པ་རྣམས་ལ་འཁོར་གྱི་བྱིས་པ་དང་། བུད་མེད་འདོད་པ་རྣམས་ལ་བུད་མྱེད་དང་། བུ་མོ་གཞོན་ནུ་འདོད་པ་རྣམས་ལ་བུ་མོ་གཞོན་ནུ་དང་། ཅོད་པན་དང་གཙུག་གི་རིན་པོ་ཆེ་འདོད་པ་རྣམས་ལ་ཅོད་པན་དང་གཙུག་གི་རིན་པོ་ཆེ་དང་། ཐོར་པག་དང་བཅས་པའི་གཙུག་གི་རིན་པོ་ཆེ་འདོད་པ་རྣམས་ལ་ཐོར་པག་དང་བཅས་པའི་གཙུག་གི་རིན་པོ་ཆེ་དང་། སྐྲ་མཐོན་ཏིང་དྲི་མ་མྱེད་པའི་དཀྱིལ་འཁོར་འདོད་པ་རྣམས་ལ་སྐྲ་མཐོན་ཏིང་དྲི་མ་མྱེད་པའི་དཀྱིལ་འཁོར་གྱི་སྦྱིན་པ་བྱེད་པ་ནས།
en: jewelry and adornments to those who wish for jewelry and adornments; jewels to those who wish for jewels; gold to those who wish for gold; silver to those who wish for silver; pearls to those who wish for pearls; dwellings to those who wish for dwellings; seats to those who wish for seats; beds to those who wish for beds; medicine that heals illness to those who wish for medicine that heals illness; utensils to those who wish for utensils; carriages to those who wish for carriages; steeds to those who wish for steeds; elephants, horses, chariots, oxen, donkeys, water buffalo, sheep, and goats to those who wish for elephants, horses, chariots, oxen, donkeys, water buffalo, sheep, and goats; banners, parasols, and flags to those who wish for banners, parasols, and flags; male and female slaves to those who wish for male and female slaves; a retinue of youths to those who wish for a retinue of youths; women to those who wish for women; girls to those who wish for girls; crowns and topknot jewels to those who wish for crowns and topknot jewels; topknot jewels combined with leather to those who wish for topknot jewels combined with leather; locks of pure, deep-black hair to those who wish for locks of pure, deep-black hair;

source: ཡོ་བྱད་སྣ་ཚོགས་ཐམས་ཅད་འདོད་པ་རྣམས་ལ་ཡང་ཡོ་བྱད་སྣ་ཚོགས་ཐམས་ཅད་ཀྱི་སྦྱིན་པ་བྱེད་དོ།
en: and so on, up to I give all the various kinds of utensils to those who wish for all the various kinds of utensils.

source: །རིགས་ཀྱི་བུ་ཡུད་ཙམ་ཞིག་སྡོད་དང་། དེའུ་རེ་མངོན་སུམ་དུ་མཐོང་བར་འགྱུར་རོ།
en: “Noble one, stay a moment and you will see a sight.”

source: དེ་སྐད་དུ་ཁྱིམ་བདག་མཁས་པས། ཚིག་དེ་བརྗོད་མ་ཐག་ཏུ་དེའི་མོད་ལ་སེམས་ཅན་གྲངས་མེད་པ་ཞིག་ཁྱིམ་བདག་མཁས་པའི་སྔོན་གྱི་སྨོན་ལམ་གྱིས་བོས་པས། ཕྱོགས་ཐ་དད་པ་དང་། ཡུལ་ཐ་དད་པ་དང་། གནས་ཐ་དད་པ་དང་། གྲོང་ཁྱེར་ཐ་དད་པ་དང་། གྲོང་རྡལ་ཐ་དད་པ་དང་། ཚོང་འདུས་ཐ་དད་པ་དང་། ལྗོངས་ཐ་དད་པ་དང་། འཁོར་གྱི་གྲོང་ཐ་དད་པ་དང་། ཁྱིམ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་རྒྱུད་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་རིས་ཐ་དད་པ་དང་། སེམས་ཅན་རྣམ་པ་མྱི་མཐུན་པ་ཐ་དད་པ་དང་། ལམ་གྱི་རྒྱུད་ཐ་དད་པ་དང་། གནས་ཀྱི་རྣམ་པ་དང་། མྱིང་དུ་བྱ་བ་ཐ་དད་པ་ནས།
en: As soon as the householder Vidvān said those words, at that moment, having been invited by the householder Vidvān in the prayers he had made in the past, there came countless beings from different directions, from different lands, from different districts, from different towns, from different markets, from different cities, from different villages, from different hamlets, from different houses, from different castes, from different families, from different levels of families, from different ways of life, and from different classifications of stations in life.

source: སེམས་ཅན་སྐྱེ་མཆེད་རྣམ་པ་ཐ་དད་པ་སྣ་ཚོགས་དང་ལྡན་པ། ཁ་ཟས་སྣ་ཚོགས་དོན་དུ་གཉེར་བ་ཁ་ཟས་སྣ་ཚོགས་འདོད་པ། བསམ་པ་ཐ་དད་པ་བཟའ་བ་དང་བཏུང་བ། གཙང་མ་འདོད་པ་དང་། ཤ་འདོད་པ་དང་། ཁ་ཟས་རྣམ་པ་ཐ་དད་པ་སྣ་ཚོགས་དོན་དུ་གཉེར་བ། ལམ་གྱི་རྒྱུད་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཁྱད་པར་དུ་སྐྱེས་པའི་སྐྱེ་མཆེད་ལ་གནས་པ་འདི་ལྟ་སྟེ།
en: These beings had various different sensory perceptions, wishing for various kinds of food, desiring various kinds of food, with various aspirations, desiring different aspirations and desires, desiring pure food and drink, desiring meat, wishing to consume contrasting kinds of different food, and remaining in various kinds of distinct sensory perceptions and different ways of life.

source: མིའི་ནང་ནས་འབྲས་ཆན་དང་། སྲན་ཆན་དང་། ཁུར་བ་དང་། སྐྱོ་མ་དང་། ཉ་དང་། ཤ་ལ་སོགས་པ་ཁམ་གྱིས་བཟའ་བའི་ཁ་ཟས་སྣ་ཚོགས་དོན་དུ་གཉེར་བ་དང་། མིའི་ནང་ནས་ཇི་ལྟ་བ་བཞིན་དུ་འགྲོ་བའི་རྒྱུད་ཐམས་ཅད་ན་རྣམ་པར་སྤྱོད་པ་དག་ལས་ཀྱང་།
en: In other words, among humans there were those who wished for such various kinds of food as boiled rice, sour gruel, broths , fish, and meat.

source: ཁ་ཟས་དང་བཏུང་བ་སྣ་ཚོགས་དོན་དུ་གཉེར་བ་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་མཐུ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྦྱིན་པ་ཐོགས་པ་མྱེད་པར་གཏོང་བའི་རྔའི་སྒྲ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྔོན་གྱི་སྨོན་ལམ་གྱིས་བོས་པས་ཀུན་ཀྱང་འོངས་བར་གྱུར་ཏེ། འོངས་ནས་ཀྱང་ཁྱིམ་བདག་མཁས་པ་ལ་སློངས་མོ་འདེབས་སོ།
en: Whatever were the different kinds of food and drink that were wished for by those with different ways of life among human beings, through the power of the bodhisattva, the drumbeat of the unimpeded generosity of the bodhisattva, and the invitation made by the past prayers of the bodhisattva, all those human beings came there, and when they had arrived they entreated the householder Vidvān.

source: །གདོང་དུ་ལྟའོ།
en: They looked upon him, observed him, and addressed him.

source: །སྡོད་དེ། གསོལ་བ་འདེབས་སོ། དེ་ནས་ཁྱིམ་བདག་མཁས་པས་སློང་བ་དེ་དག་ཀུན་ནས་འདུས་པར་ཤེས་ནས། ཡུད་ཙམ་དུ་བསམས་ཏེ་ནམ་མཁའ་ལ་བལྟས་པ་དང་། ནམ་མཁའི་དབྱིངས་ནས།
en: The householder Vidvān, knowing that the petitioners had all gathered there, thought for a moment and then looked up into the sky.

source: ཁ་ཟས་དང་བཏུང་བ་རྣམ་པ་སྣ་ཚོགས་རོ་སྣ་ཚོགས་དང་ལྡན་པ། ཁ་དོག་སྣ་ཚོགས་དང་ལྡན་པ། དྲི་སྣ་ཚོགས་དང་ལྡན་པ་མང་པོ་འཐོན་ཏེ། ལག་མཐིལ་དུ་འོངས་པར་གྱུར་ཏོ།
en: From the realm of the sky there came into the palms of his hands a great number of various kinds of food and drink, with various kinds of flavors, various kinds of colors, and various kinds of aromas.

source: དེས་དེ་དག་ཡོངས་སུ་བླངས་ཤིང་དེ་ལྟར་ཀུན་ནས་འདུས་པའི་སློངས་མོ་བ་མོས་པ་སྣ་ཚོགས་དང་ལྡན་པ། དེ་དག་ཅི་འདོད་པའི་ཟས་དང་། བཏུང་བའི་རྣམ་པ་དང་། ཡོ་བྱད་ཀྱི་ཁྱད་པར་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་ཚིམ་པར་བྱས་སོ། །ཅི་འདོད་པ་ཡོངས་སུ་བྱིན་ནོ། །རབ་ཏུ་དགའ་བར་བྱས་སོ། ཤིན་ཏུ་ཚིམ་པར་བྱས་སོ། དགའ་བ་ཤིན་ཏུ་སྐྱེ་བར་བྱས་སོ། །ཉམས་ཤིན་ཏུ་བདེ་བར་བྱས་སོ། །ཡིད་རབ་ཏུ་དགའ་བར་བྱས་སོ།
en: He gave these different kinds of food, drink, and utensils to all the petitioners gathered there, who had different aspirations and desires, in accordance with what they desired, so that they were satiated, pleased, contented, delighted, joyful, and overwhelmed with happiness.

source: །དེ་ལྟར་དེ་དག་ཤིན་ཏུ་ཚིམ་པར་བྱས་ནས། དེས་ཀྱང་མ་ཆོག་སྟེ། དེའི་འོག་ཏུ་ཆོས་བསྟན་པ་འདི་ལྟ་སྟེ།
en: Having concluded satisfying them in that way, afterward he taught them the Dharma.

source: ཡེ་ཤེས་ཀྱི་ཚོགས་རྒྱ་ཆེན་པོ་བསྩགས་པའི་རྒྱུ་ཡོངས་སུ་བརྗོད་དེ་ཆོས་བསྟན་ཏོ། །ཕོངས་པ་ཐམས་ཅད་འབྱུང་བ་མི་སྲིད་པའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་དང་། སྐྱིད་པ་ཆེན་པོ་ཡོངས་སུ་འགྲུབ་པར་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་དང་། ཆོས་ཀྱི་ཡེ་ཤེས་ཀྱི་ཚུལ་འཐོབ་བ་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་དང་། བསོད་ནམས་ཀྱི་ཚོགས་རྒྱ་ཆེན་པོ་བསྩགས་པའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་དང་། དགའ་བ་བཟའ་བའི་ཟས་རབ་ཏུ་འཐོབ་པ་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་དང་། མཚན་དང་དཔེ་བྱད་བཟང་པོས་ཤིན་ཏུ་བརྒྱན་པའི་ལུས་འཐོབ་པ་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་དང་། ཐུབ་པ་མྱེད་པའི་སྟོབས་རྣམ་པར་དག་པར་འཐོབ་པ་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་དང་། བླ་ན་མྱེད་པའི་ཁ་ཟས་ཡོངས་སུ་ཤེས་པ་འཐོབ་པ་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་དང་། བདུད་ཀྱི་དཔུང་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པའི་བསོད་ནམས་ཀྱི་སྟོབས་མྱི་ཟད་པ་རབ་ཏུ་འཐོབ་པ་འབྱུང་བའི་རྒྱུ་ཡོངས་སུ་བརྗོད་པ་བྱས་ཏེ་ཆོས་སྟོན་ཏོ།
en: He taught the Dharma that elucidated the cause of gathering a vast accumulation of wisdom, elucidated the cause that made it impossible for poverty to occur, elucidated the cause of the arising of perfect great enjoyment, elucidated the cause of the arising of the attainment of the Dharma’s way of wisdom, elucidated the cause of the arising of gathering a vast accumulation of merit, elucidated the cause of the arising of the attainment of the enjoyment of the food of happiness, elucidated the cause of the arising of the attainment of a body adorned by the signs and features of a great being, elucidated the cause of the arising of the attainment of invincible strength, elucidated the cause of the arising of the attainment of the unsurpassable food of wisdom, and elucidated the cause of the arising of the attainment of the inexhaustible strength of merit that defeats the strength of all the māras.

source: །དེས་ཁ་ཟས་དོན་དུ་གཉེར་ཅིང་འོངས་པ་རྣམས་ལ་ནམ་མཁའི་དབྱིངས་ནས་ཁ་ཟས་རྣམ་པ་སྣ་ཚོགས་བླངས་ཤིང་ཚིམ་པར་བྱས་ཏེ། དེ་དག་ལ་ཚེ་དང་། མདོག་དང་། སྟོབས་དང་། བདེ་བ་དང་། སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ། འཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་བསྟན་ཏོ།
en: When all those who came wishing for food were satisfied through having obtained various kinds of food from the realm of the sky, the householder Vidvān taught them the Dharma so that they could attain perfect lifespans, color, strength, happiness, and eloquence.

source: །དེས་བཏུང་བ་དོན་དུ་གཉེར་ཅིང་འོངས་པ་རྣམས་ལ་བཏུང་བ་མང་པོ་ཞིམ་པ་ཁ་ན་མ་ཐོ་བ་མེད་པ། ཡིད་ཤིན་ཏུ་དགའ་བར་བྱེད་པ་དག་གིས་ཚིམ་པར་བྱས་ནས། དེ་དག་ལ་འཁོར་བས་སྐོམ་ཞིང་འཁོར་བ་ལ་དགའ་བ་ལས་རྣམ་པར་བཟློག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ལ་དགའ་ཞིང་སངས་རྒྱས་ཀྱི་ཆོས་ལ་མོས་པ་ཡོངས་སུ་བསྐྱེད་པའི་ཕྱིར་ཆོས་བསྟན་ཏོ།
en: When all those who came wishing for drink were satisfied and delighted through having obtained many kinds of delicious, nontransgressive drinks, the householder Vidvān taught them the Dharma so that they would turn away from thirsting for saṃsāra, from delighting in saṃsāra, and would develop a delight in the Buddhadharma, a thirst for the Buddhadharma.

source: དེས་རོའི་མཆོག་དོན་དུ་གཉེར་ཅིང་འོངས་པ་རྣམས་ལ་རོའི་མཆོག་སྣ་ཚོགས་དང་རབ་དང་། སྐྱུར་བ་དང་། ལན་ཚ་དང་། ཚ་བ་དང་། ཁ་བ་དང་། །བསྐ་བ་རྣམ་པ་ཐ་དད་པས་ཡོངས་སུ་ཚིམ་པར་བྱས་ཏེ། དེའི་འོག་ཏུ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་རོ་བྲོ་བའི་མཆོག་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཆོས་བསྟན་ཏོ།
en: After all those who came wishing for excellent flavors had been satisfied by the different excellent flavors of sweetness, sourness, saltiness, spiciness, bitterness, and astringency, the householder Vidvān taught them the Dharma so that they would attain the supreme flavor of the physical signs of a great being.

source: །དེས་བཞོན་པ་དོན་དུ་གཉེར་ཅིང་ཕྱོགས་ཀྱི་རྒྱུད་སྣ་ཚོགས་ནས་འོངས་པ་རྣམས་ལ་བཞོན་པ་སྣ་ཚོགས་ཀྱི་སྦྱིན་པས་ཡོངས་སུ་བསྡུད་དེ། དེ་དག་ཐེག་པ་ཆེན་པོ་ལ་གནས་པར་བྱ་བའི་ཕྱིར་ཆོས་བསྟན་ཏོ།
en: When all those who had come from all directions wishing for carriages had received the gifts of different kinds of carriages, the householder Vidvān taught them the Dharma so that they would ride upon the Mahāyāna.

source: །དེས་གོས་དོན་དུ་གཉེར་ཅིང་ཕྱོགས་སྣ་ཚོགས་ནས་འོངས་པ་ཀུན་ནས་འདུས་པར་ཤེས་ནས།
en: When those wishing for clothes had come from all directions, the householder Vidvān, knowing that they had all gathered there, thought for a moment and then looked up into the sky.

source: ཡུད་ཙམ་དུ་བསམས་ཏེ། ནམ་མཁའི་དབྱིངས་ལ་བལྟས་པ་དང་། ནམ་མཁའི་དབྱིངས་ལས་གོས་སྣ་ཚོགས་དང་། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། ལེ་བརྒན་དང་། ཤེལ་གྱི་ཁ་དོག་ཏུ་འདུག་པ་ཁ་དོག་སྣ་ཚོགས་ཅན་ཁ་དོག་དུ་མར་རྣམ་པར་དག་པ་དག་འཐོན་ཅིང་ལག་པའི་མཐིལ་དུ་འོངས་པས། དེས་དེ་དག་གིས་སློངས་མོ་བ་དེ་དག་ལ་ཡོངས་སུ་བསྡུད་ནས།
en: From the realm of the sky appeared many kinds of pure clothes in various colors—blue, yellow, red, white, madder, and transparent —that came into the palms of his hands.

source: དེ་བཞིན་གཤེགས་པའི་ངོ་ཚ་ཤེས་པ་དང་། ཁྲེལ་ཡོད་པ་བླ་ན་མྱེད་པ་དང་། མདོག་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་ཐོབ་པར་འགྱུར་བ་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་ཆོས་བསྟན་ཏོ། །དེ་བཞིན་དུ་ཡོ་བྱད་སྣ་ཚོགས་ཐམས་ཅད་ཀྱིས་ཇི་ལྟར་འོངས་པའི་སློངས་མོ་བ་རྣམས་ལ་སྡུད་པ་བྱས་ནས། ཅི་རིགས་སུ་ཆོས་བསྟན་ཏོ།
en: When the householder Vidvān had distributed these to the petitioners, he taught them the Dharma so that they would have the pure attainment of a tathāgata’s unsurpassable sense of shame and conscience that is like the color of gold.

source: །དེ་ལྟར་ཁྱིམ་བདག་མཁས་པས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡུལ་བསྟན་པ་བྱས་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: In that way, the householder Vidvān demonstrated the inconceivable scope of the bodhisattva liberation.

source: །རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་ཡིད་ཀྱི་མཛོད་ནས་བྱུང་བའི་བསོད་ནམས་ཀྱི་རྣམ་པར་ཐར་པ་འདི་ཤེས་པར་ཟད་ན།
en: Then he said to Sudhana, the head merchant’s son, “I know only the bodhisattva liberation called the merit that arises from the treasury of the mind . How could I know the conduct, describe the qualities, or teach the miraculous powers of the bodhisattvas who have attained the power over requisites;

source: ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་ཡོ་བྱད་ལ་དབང་ཐོབ་པ་རིན་པོ་ཆེའི་ལག་པ་ཐོབ་པར་གྱུར་པ།
en: who have attained jewel-producing hands;

source: འཇིག་རྟེན་གྱི་ཁམས་མ་ལུས་པ་ཐམས་ཅད་ལག་པས་ཡོངས་སུ་ཁེབས་པར་བྱས་ཤིང་། སངས་རྒྱས་ཀྱི་མཆོད་པ་སྣ་ཚོགས་བསྒྲུབ་པའི་ཕྱིར།
en: who can cover all world realms without exception with their hands in order to accomplish various offerings to the buddhas; who can send down rain from clouds of jewels of various colors upon the circles of the followers of all the tathāgatas;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་དུ་རིན་པོ་ཆེ་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་གྱི་ཆར་རབ་ཏུ་འབེབས་པ་དེ་བཞིན་དུ་རྒྱན་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་དང་། ཅོད་པན་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་དང་། ཁང་པ་བརྩེགས་པ་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་དང་། ན་བཟའ་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་དང་། ལྷ་རྫས་ཀྱི་རོལ་མོ་བརྡུང་བ་དང་དཀྲོལ་བ་དང་། གླུ་ཡིད་དུ་འོང་བའི་དབྱངས་སྙན་པ་སྣ་ཚོགས་ཀྱི་སྤྲིན་དང་། མེ་ཏོག་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་དང་། སྤོས་ཁ་དོག་སྣ་ཚོགས་ཀྱི་སྤྲིན་དང་། བདུག་སྤོས་དང་ཕྲེང་བ་དང་བྱུག་པ་དང་། ཕྱེ་མ་དང་ཆོས་གོས་དང་། གདུགས་དང་རྒྱལ་མཚན་དང་། བ་དན་ཁ་དོག་སྣ་ཚོགས་དང་། རྣམ་པ་ཐམས་ཅད་དུ་སངས་རྒྱས་ཐམས་ཅད་མཆོད་པའི་སྤྲིན་གྱི་ཆར་དང་། དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནས་སུ་སངས་རྒྱས་ཐམས་ཅད་མཆོད་ཅིང་བསྙེན་བཀུར་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། གདུལ་བར་བྱ་བའི་ཕྱིར་ཡོ་བྱད་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་ཆར་འབེབས་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པ་འམ། ཡོན་ཏན་བརྗོད་པའམ། རྣམ་པར་འཕྲུལ་བ་བསྟན་པ་ནུས་རེ་སྐན།
en: and similarly can send down rain from clouds of jewelry of various colors, from clouds of crowns of various colors, from clouds of kūṭāgāras of various colors, from clouds of clothing of various colors, from clouds of the various melodious sounds of divine musical instruments being played and beaten and beautiful songs, from clouds of flowers of various colors, from clouds of perfumes of various colors, from clouds of incense, garlands, ointments, powders, Dharma robes, parasols, banners, and flags of various colors, from clouds of every kind of offering to all the buddhas, and from clouds of all requisites that fall upon all the circles of followers of the tathāgatas and all realms of beings in order to honor and make offerings to all the buddhas and in order to ripen and guide all beings? “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་གྲོང་ཁྱེར་སེང་གེའི་གཟུགས་ཤེས་བྱ་བ་ཡོད་དེ། དེ་ན་ཆོས་ཀྱི་ཚོང་དཔོན་རིན་ཆེན་གཙུག་ཕུད་ཅེས་བྱ་བ་འདུག་གིས།
en: In this southern region there is a town called Siṃhapota, where dwells a head-merchant patron of the Dharma by the name of Ratnacūḍa.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགའ་རངས་ཏེ།
en: Go to him and ask him, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’

source: མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས་ཁྱིམ་བདག་མཁས་པ་ལ་ཆོས་ཀྱི་རིམ་གྲོས་སློབ་མའི་ཚུལ་བསྟན་ཏེ།
en: Sudhana, the head merchant’s son, was pleased, delighted, enraptured, overjoyed, and filled with happiness. He demonstrated to the householder Vidvān the respect of a Dharma pupil.

source: དེའི་བྱིན་གྱི་རླབས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཐོབ་པར་འགྱུར་བར་ཡོངས་སུ་བལྟ་ཞིང་།
en: Sudhana viewed him as someone through whose blessing one can receive all the Buddhadharma, viewed him as someone through reliance on whom one can attain omniscience; he demonstrated a continuous delight in the kalyāṇamitras;

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་དེ་ལ་རང་ལུས་པར་བལྟ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་དབེན་པར་སེམས་པ་རྒྱུན་མྱི་འཆད་པར་བསྟན་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་བཀའ་ཤིན་ཏུ་ཉན་པའི་སེམས་དང་ལྡན་པར་བསྟན་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་དབང་དུ་འགྱུར་བའི་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་དང་། ཚིག་མཉན་པར་བྱ་བ་དང་། དགེ་བའི་བཤེས་གཉེན་ལས་བྱུང་བའི་དད་པའི་དབང་པོ་ལ་བསམ་པ་བྱེད་ཅིང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་བཏམ་སྟེ་བཏང་བས།
en: he had the determination to obey every instruction of the kalyāṇamitras; being under their power he followed the kalyāṇamitras; he longed to listen to the teachings and words of the kalyāṇamitras; he kept in mind the power of faith that came from the kalyāṇamitras; he sought the instructions of the kalyāṇamitras;

source: དགེ་བའི་བཤེས་གཉེན་བསྙེན་ཅིག་བཀུར་བ་དང་། །རྗེས་སུ་འབྲང་བར་བྱ་བའི་སེམས་ཀྱིས།
en: and he aspired to follow and please the kalyāṇamitras.

source: ཁྱིམ་བདག་མཁས་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ཁྱིམ་བདག་མཁས་པ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། ཁྱིམ་བདག་མཁས་པའི་དྲུང་ནས་སོང་ངོ་།
en: Sudhana bowed his head to the feet of the householder Vidvān, circumambulated the householder Vidvān, keeping him to his right, many hundreds of thousands of times, and, looking back again and again, departed from the householder Vidvān.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བསོད་ནམས་ཀྱི་ཆུ་བོ་དེ་ལ་ནི་ཡིད་ཆེས་པར་སེམས།
en: Ratnacūḍa Sudhana, the head merchant’s son, had conviction in that river of merit.

source: བསོད་ནམས་ཀྱི་ཞིང་དེ་ལ་ནི་ཡང་དག་པར་བལྟ།
en: He viewed that field of merit.

source: བསོད་ནམས་ཀྱི་རི་བོ་དེ་ནི་ཡོངས་སུ་སྦྱོང་།
en: He purified that mountain of merit.

source: བསོད་ནམས་ཀྱི་མུ་སྟེགས་དེ་ལ་ནི་ཡང་དག་པར་འཛེག །བསོད་ནམས་ཀྱི་མཛོད་དེ་ནི་རྣམ་པར་འབྱེད།
en: He climbed down that stairway to the bathing place of merit. He opened that treasury of merit.

source: བསོད་ནམས་གྱི་གཏེར་དེ་ལ་ནི་ཤིན་ཏུ་ལྟ།
en: He viewed that treasure of merit.

source: བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ནི་ཡང་དག་པར་ལེན།
en: He carried away that heap of merit.

source: བསོད་ནམས་ཀྱི་སྟོབས་དེ་ནི་ཡོངས་སུ་བསྐྱེད།
en: He developed that strength of merit.

source: བསོད་ནམས་ཀྱི་ཤུགས་དེ་ནི་རྣམ་པར་འཕེལ་བར་བྱེད་ཅིང་།
en: He increased that power of merit.

source: མཐར་གྱིས་གྲོང་ཁྱེར་སེང་གེའི་གཟུགས་གང་ན་བ་དེར་ཕྱིན་ཏེ།
en: Sudhana eventually arrived at the town of Siṃhapota.
